export const uk = {
  menu: {
    logoLabel: "Гра починається. Зможеш витримати?",
    playCTA: "Грати",
    rulesCTA: "Правила",
    settingsCTA: "Налаштування",
  },
  setup: {
    title: "🎮 Налаштування гри",
    paragraphs: [
      "Перш ніж почати, налаштуйте гру під свою компанію.",
      "Ви можете встановити ліміт карт, обмеження часу або грати без обмежень.",
      "Якщо ввімкнено багатомовний режим — кожен гравець бачитиме завдання на карті своєю мовою.",
      "Готові почати? Хай почнеться безумство!",
    ],
    play: "Грати",
    setupScreen: 'Екран налаштувань гри може бути відключений в налаштуваннях',
  },
  pwa: {
    label:
      "Щоб грати було зручніше, додайте цю гру на головний екран. Вона відкриватиметься швидше, працюватиме офлайн і виглядатиме як повноцінний застосунок.",
    skip: "Пропустити",
    iOS: {
      NotSafari: [
        "Натисніть тут, щоб скопіювати посилання",
        "Відкрийте Safari",
        "Вставте скопійоване посилання в адресний рядок",
      ],
      Safari: [
        'Натисніть на іконку "Поділитися"',
        'Виберіть "Додати на головний екран"',
        'Натисніть "Додати" для підтвердження',
      ],
    },
    Android: {
      Supported: [
        "Натисніть на три крапки",
        'Виберіть "Додати на головний екран"',
        'Натисніть "Додати", щоб підтвердити',
      ],
      notSupported: [
        "Натисніть тут, щоб скопіювати посилання",
        "Відкрийте Chrome",
        "Вставте скопійоване посилання в адресний рядок",
      ],
    },
  },
  rules: {
    mainTitle: "🎴Правила гри",
    goal: {
      title: "🌬️ Мета:",
      paragraphs: [
        "Тягни карти, виконуй інструкції і спробуй вижити до кінця (якщо він є).",
      ],
    },
    howToPlay: {
      title: "🔷 Як грати:",
      paragraphs: [
        "Під час свого ходу тягни одну карту з колоди.",
        "Виконай дію, написану на карті.",
        "Потім скинь карту — твій хід завершено.",
        "Наступний гравець тягне карту, і гра триває.",
      ],
    },
    gameModes: {
      title: "🔄 Режими гри:",
      paragraphs: [
        "Безкінечна колода — карти можуть повторюватися без обмежень.",
        "36 карт — класична коротка колода (від 6 до туза).",
        "52 карти — повна стандартна колода.",
      ],
    },
    gameDuration: {
      title: "⏰ Тривалість гри:",
      paragraphs: [
        "Без обмежень — грай скільки завгодно.",
        "Користувацький час — встанови тривалість до початку гри.",
      ],
    },
    footer: {
      lines: ["Нехай почнеться хаос.", "Чи зможеш дійти до кінця?"],
    },
  },
  settings: {
    cardLimit: "Ліміт карт",
    cardLimitTooltip:
      "Обмежте кількість карт у грі. Після досягнення ліміту гра завершиться.",
    limitTime: "Ліміт часу (хв)",
    limitTimeTooltip: "Встановіть час гри. Коли час вийде — гра завершиться.",
    music: "Музика",
    musicTooltip: "Увімкнути або вимкнути фонову музику.",
    sounds: "Звуки",
    soundsTooltip: "Увімкнути або вимкнути звукові ефекти.",
    background: "Тема",
    backgroundTooltip: "Виберіть тему для гри.",
    backgroundSonner: {
      sonnerText: "Оновіть сторінку, щоб побачити всі зміни!",
      buttonLabel: "Оновити",
    },
    multiLanguage: "Багато мовність",
    multiLanguageTooltip: "Дозволяє гравцям змінювати мову правил під час гри.",
    gameSetUp: "Настройка гри",
    gameSetUpTooltip:
      "Показувати екран налаштування гри перед початком нової гри",
    language: "Мова",
    languageTooltip: "Обрати мову інтерфейсу гри.",
    yesOption: "Так",
    noOption: "Ні",
  },
  game: {
    showCard: "Показати карту",
    cardAction: {
      c2: "Задай будь-яке питання іншому гравцю. Якщо він не відповість — випиває. Якщо не хочеш питати — пий сам.",
      c3: "Обери категорію (наприклад, марки авто). Кожен по черзі називає приклад. Хто не згадає — п’є.",
      c4: "Ти можеш у будь-який момент покласти палець на стіл. Інші мають повторити. Хто зробить це останнім — п’є.",
      c5: "Всі кладуть руку на голову. Хто зробив це останнім — п’є.",
      c6: "Пропусти свій хід.",
      c7: "По колу називайте числа. Не можна говорити числа, які діляться на 7 або містять цифру 7. Помилився — п’єш.",
      c8: "Столом придумайте фразу, яку ти маєш казати перед або після того, як вип’єш. Забув — п’єш ще раз.",
      c9: "Столом придумайте дію, яку ти маєш виконувати перед або після того, як вип’єш. Забув — п’єш ще раз.",
      c10: "До кінця кола ти не можеш відповідати на запитання інших гравців.",
      c11: "Випиваєш ти і гравець справа від тебе.",
      c12: "Усі кладуть руку на стіл. Ти вирішуєш, коли можна прибрати руки. Хто прибрав останнім — п’є.",
      c13: "Ти обираєш, хто має пити. Можеш вказати будь-кого, навіть кілька разів поспіль одного й того ж.",
      c14: "Всі за столом п’ють!",
    },
    cardLeft: "карт залишилось",
    gameEnd: "Гра закінчилась, граємо ще раз?",
    CtaPlayAgain: 'Грати',
    CtaFinishGame: 'Головне меню',
    EndGameModalTitle: '🎉 Гру завершено',
    EndGameModalDescrition: 'Раунд закінчено! Ви можете почати нову гру або повернутися в головне меню.',

  },
};
